# Из домашнего заданий 2 задача 3
# старое решение
# print('Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.'
#       '\nПример:'
#       '\n- Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]')
# num = int(input('Введите значение целого числа "N" ->  '))
# List2 = []
# for i in range(num):
#     j = i + 1
#     temp = (1 + 1 / j) ** j
#     List2.insert(i, temp)
# print(List2)

print(list(map(lambda x: (1+1/x)**x, [i for i in range(1, int(input('Введите значение целого числа "N" ->  '))+1)])))