# Из домашнего заданий 3 задача 1
# старое решение
# print("\033[36m{}".format('Задайте список из нескольких чисел. Напишите программу,\n'
#                           'которая найдёт сумму элементов списка, стоящих на нечётной позиции.\n'
#                           '*Пример:*\n'
#                           '- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12'))
# num = int(input("\033[0m{}".format('Укажите размер списка ->  ')))
# List01 = []
# result = 0
# for i in range(num):
#     List01.insert(i, i+1)
#     if i%2 !=0:
#         result = result + List01[i]5
# print("\033[32m{}".format(f'=================================================\n'
#                           f'Сгенерирован список: {List01}\n'
#                           f'Сумма нечетных позиций равна: {result}\n'
#                           f'=================================================\n'))
import random, functools
list1 = [random.randint(1, 9) for i in range(1, int(input('Укажите размер списка ->  '))+1)]
print(f'сумма нечетных чисел списка {list1} равна: {functools.reduce(lambda a, b: a + b, [list1[i] for i in range(len(list1)) if i%2 != 0])}')